; domain
(define (domain delivery-p2)
  (:requirements :strips :fluents )

  (:predicates 
  				(crate ?c) 
				(agent ?a) 
				(at-location ?p) ; by default we mean here that person is at loction in order to avoide redundancy
				(at ?t ?l) 
				(in ?c ?a) 
	       		(capacity ?a ?n) 
	)

  (:functions (capacity ?r) ; declare function with capacity 
  )

  (:action load ; loading crate from loaction by agent 
	   :parameters 		(?c ?r ?l)
	   :precondition 	(and (crate ?c) (agent ?r) (at-location ?l)
	   					(at ?c ?l) (at ?r ?l) (< (capacity ?r) 4) ; as it should load 4 crate 
				  		)
	   :effect 			(and (not (at ?c ?l)) (in ?c ?r) (increase (capacity ?r) 1) ; increment 1 until it reach to max 4 quantity as per decleration
	   					)
	)

  (:action unload ; unloading crate into desire location where person is located
	   :parameters 		(?c ?r ?l)
	   :precondition 	(and (crate ?c) (agent ?r) (at-location ?l)
			    		(in ?c ?r) (at ?r ?l) (> (capacity ?r) 0)
				 		 )
	   :effect 			(and (not (in ?c ?r)) (at ?c ?l) (decrease (capacity ?r) 1) ; decrease 1 when unload and so on
	   					)
	)

  (:action fly ; as helicopter to be fly from source to destination 
	   :parameters 		(?r ?dep ?dst)
	   :precondition 	(and (agent ?r) (at-location ?dep) (at-location ?dst)(at ?r ?dep)
				   		)
	   :effect 			(and (not (at ?r ?dep)) (at ?r ?dst) 
	   					)
	)

  )

; problem
(define (problem delivery-prob2)
  (:domain delivery-p2)
  (:objects 
          ; declation person at location
          depot p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14
  
          ; agent declation
          r1 r2 r3 r4

          ; crate consist of food and medicine and their decleration 
          crate_1 crate_2 crate_3 crate_4 crate_5 crate_6 crate_7 crate_8 crate_9 crate_10 crate_11 crate_12 crate_13 crate_14
	    )
  (:init
          ; capacity intialization all robot has 0 capacity
          (= (capacity r1) 0) (= (capacity r2) 0)
          (= (capacity r3) 0) (= (capacity r4) 0)
  

            (at-location depot)
            
            ; intialization of person at location 
            (at-location p1) (at-location p2) (at-location p3) (at-location p4) (at-location p5) 
            (at-location p6) (at-location p7) (at-location p8) (at-location p9) (at-location p10) (at-location p11) 
            (at-location p12) (at-location p13) (at-location p14)
   
            ; intialization agents
            (agent r1) (agent r2) (agent r3) (agent r4) 
   
            ; intialization of crate
            (crate crate_1) (crate crate_2) (crate crate_3) (crate crate_4) (crate crate_5) (crate crate_6) (crate crate_7) (crate crate_8) 
            (crate crate_9) (crate crate_10) (crate crate_11) (crate crate_12) (crate crate_13) (crate crate_14)
   
            ; intialization of agent at location depot
            (at r1 depot) (at r2 depot) (at r3 depot) (at r4 depot)
   
            ; intialization of all crate at location depot
            (at crate_1 depot) (at crate_2 depot) (at crate_3 depot) (at crate_4 depot) (at crate_5 depot) (at crate_6 depot) (at crate_7 depot) 
            (at crate_8 depot) (at crate_9 depot) (at crate_10 depot) (at crate_11 depot) (at crate_12 depot) (at crate_13 depot) (at crate_14 depot)
   
   )
   
  (:goal (and 
              (at crate_1 p1) (at crate_2 p2) (at crate_3 p3) (at crate_4 p4) (at crate_5 p5) (at crate_6 p6) 
              (at crate_7 p7) (at crate_8 p8) (at crate_9 p9) (at crate_10 p10) (at crate_11 p11) 
              (at crate_12 p12) (at crate_13 p13) (at crate_14 p14)
          )
  )
  )

; plan
1. (load crate_14 r1 depot)
   deleted: (at crate_14 depot)
   added: (in crate_14 r1)
   changed: (capacity r1) from 0 to 1
   goals met: 0 of 14
2. (fly r1 depot p1)
   deleted: (at r1 depot)
   added: (at r1 p1)
   goals met: 0 of 14
3. (fly r1 p1 p2)
   deleted: (at r1 p1)
   added: (at r1 p2)
   goals met: 0 of 14
4. (fly r1 p2 p3)
   deleted: (at r1 p2)
   added: (at r1 p3)
   goals met: 0 of 14
5. (fly r1 p3 p4)
   deleted: (at r1 p3)
   added: (at r1 p4)
   goals met: 0 of 14
6. (fly r1 p4 p5)
   deleted: (at r1 p4)
   added: (at r1 p5)
   goals met: 0 of 14
7. (fly r1 p5 p6)
   deleted: (at r1 p5)
   added: (at r1 p6)
   goals met: 0 of 14
8. (fly r1 p6 p7)
   deleted: (at r1 p6)
   added: (at r1 p7)
   goals met: 0 of 14
9. (fly r1 p7 p8)
   deleted: (at r1 p7)
   added: (at r1 p8)
   goals met: 0 of 14
10. (fly r1 p8 p9)
   deleted: (at r1 p8)
   added: (at r1 p9)
   goals met: 0 of 14
11. (fly r1 p9 p10)
   deleted: (at r1 p9)
   added: (at r1 p10)
   goals met: 0 of 14
12. (fly r1 p10 p11)
   deleted: (at r1 p10)
   added: (at r1 p11)
   goals met: 0 of 14
13. (fly r1 p11 p12)
   deleted: (at r1 p11)
   added: (at r1 p12)
   goals met: 0 of 14
14. (fly r1 p12 p13)
   deleted: (at r1 p12)
   added: (at r1 p13)
   goals met: 0 of 14
15. (fly r1 p13 p14)
   deleted: (at r1 p13)
   added: (at r1 p14)
   goals met: 0 of 14
16. (unload crate_14 r1 p14)
   deleted: (in crate_14 r1)
   added: (at crate_14 p14)
   changed: (capacity r1) from 1 to 0
   goals met: 1 of 14
17. (load crate_13 r2 depot)
   deleted: (at crate_13 depot)
   added: (in crate_13 r2)
   changed: (capacity r2) from 0 to 1
   goals met: 1 of 14
18. (fly r2 depot p1)
   deleted: (at r2 depot)
   added: (at r2 p1)
   goals met: 1 of 14
19. (fly r2 p1 p2)
   deleted: (at r2 p1)
   added: (at r2 p2)
   goals met: 1 of 14
20. (fly r2 p2 p3)
   deleted: (at r2 p2)
   added: (at r2 p3)
   goals met: 1 of 14
21. (fly r2 p3 p4)
   deleted: (at r2 p3)
   added: (at r2 p4)
   goals met: 1 of 14
22. (fly r2 p4 p5)
   deleted: (at r2 p4)
   added: (at r2 p5)
   goals met: 1 of 14
23. (fly r2 p5 p6)
   deleted: (at r2 p5)
   added: (at r2 p6)
   goals met: 1 of 14
24. (fly r2 p6 p7)
   deleted: (at r2 p6)
   added: (at r2 p7)
   goals met: 1 of 14
25. (fly r2 p7 p8)
   deleted: (at r2 p7)
   added: (at r2 p8)
   goals met: 1 of 14
26. (fly r2 p8 p9)
   deleted: (at r2 p8)
   added: (at r2 p9)
   goals met: 1 of 14
27. (fly r2 p9 p10)
   deleted: (at r2 p9)
   added: (at r2 p10)
   goals met: 1 of 14
28. (fly r2 p10 p11)
   deleted: (at r2 p10)
   added: (at r2 p11)
   goals met: 1 of 14
29. (fly r2 p11 p12)
   deleted: (at r2 p11)
   added: (at r2 p12)
   goals met: 1 of 14
30. (fly r2 p12 p13)
   deleted: (at r2 p12)
   added: (at r2 p13)
   goals met: 1 of 14
31. (unload crate_13 r2 p13)
   deleted: (in crate_13 r2)
   added: (at crate_13 p13)
   changed: (capacity r2) from 1 to 0
   goals met: 2 of 14
32. (load crate_12 r3 depot)
   deleted: (at crate_12 depot)
   added: (in crate_12 r3)
   changed: (capacity r3) from 0 to 1
   goals met: 2 of 14
33. (fly r3 depot p1)
   deleted: (at r3 depot)
   added: (at r3 p1)
   goals met: 2 of 14
34. (fly r3 p1 p2)
   deleted: (at r3 p1)
   added: (at r3 p2)
   goals met: 2 of 14
35. (fly r3 p2 p3)
   deleted: (at r3 p2)
   added: (at r3 p3)
   goals met: 2 of 14
36. (fly r3 p3 p4)
   deleted: (at r3 p3)
   added: (at r3 p4)
   goals met: 2 of 14
37. (fly r3 p4 p5)
   deleted: (at r3 p4)
   added: (at r3 p5)
   goals met: 2 of 14
38. (fly r3 p5 p6)
   deleted: (at r3 p5)
   added: (at r3 p6)
   goals met: 2 of 14
39. (fly r3 p6 p7)
   deleted: (at r3 p6)
   added: (at r3 p7)
   goals met: 2 of 14
40. (fly r3 p7 p8)
   deleted: (at r3 p7)
   added: (at r3 p8)
   goals met: 2 of 14
41. (fly r3 p8 p9)
   deleted: (at r3 p8)
   added: (at r3 p9)
   goals met: 2 of 14
42. (fly r3 p9 p10)
   deleted: (at r3 p9)
   added: (at r3 p10)
   goals met: 2 of 14
43. (fly r3 p10 p11)
   deleted: (at r3 p10)
   added: (at r3 p11)
   goals met: 2 of 14
44. (fly r3 p11 p12)
   deleted: (at r3 p11)
   added: (at r3 p12)
   goals met: 2 of 14
45. (unload crate_12 r3 p12)
   deleted: (in crate_12 r3)
   added: (at crate_12 p12)
   changed: (capacity r3) from 1 to 0
   goals met: 3 of 14
46. (load crate_11 r4 depot)
   deleted: (at crate_11 depot)
   added: (in crate_11 r4)
   changed: (capacity r4) from 0 to 1
   goals met: 3 of 14
47. (fly r4 depot p1)
   deleted: (at r4 depot)
   added: (at r4 p1)
   goals met: 3 of 14
48. (fly r4 p1 p2)
   deleted: (at r4 p1)
   added: (at r4 p2)
   goals met: 3 of 14
49. (fly r4 p2 p3)
   deleted: (at r4 p2)
   added: (at r4 p3)
   goals met: 3 of 14
50. (fly r4 p3 p4)
   deleted: (at r4 p3)
   added: (at r4 p4)
   goals met: 3 of 14
51. (fly r4 p4 p5)
   deleted: (at r4 p4)
   added: (at r4 p5)
   goals met: 3 of 14
52. (fly r4 p5 p6)
   deleted: (at r4 p5)
   added: (at r4 p6)
   goals met: 3 of 14
53. (fly r4 p6 p7)
   deleted: (at r4 p6)
   added: (at r4 p7)
   goals met: 3 of 14
54. (fly r4 p7 p8)
   deleted: (at r4 p7)
   added: (at r4 p8)
   goals met: 3 of 14
55. (fly r4 p8 p9)
   deleted: (at r4 p8)
   added: (at r4 p9)
   goals met: 3 of 14
56. (fly r4 p9 p10)
   deleted: (at r4 p9)
   added: (at r4 p10)
   goals met: 3 of 14
57. (fly r4 p10 p11)
   deleted: (at r4 p10)
   added: (at r4 p11)
   goals met: 3 of 14
58. (unload crate_11 r4 p11)
   deleted: (in crate_11 r4)
   added: (at crate_11 p11)
   changed: (capacity r4) from 1 to 0
   goals met: 4 of 14
59. (fly r1 p14 depot)
   deleted: (at r1 p14)
   added: (at r1 depot)
   goals met: 4 of 14
60. (load crate_10 r1 depot)
   deleted: (at crate_10 depot)
   added: (in crate_10 r1)
   changed: (capacity r1) from 0 to 1
   goals met: 4 of 14
61. (fly r1 depot p1)
   deleted: (at r1 depot)
   added: (at r1 p1)
   goals met: 4 of 14
62. (fly r1 p1 p2)
   deleted: (at r1 p1)
   added: (at r1 p2)
   goals met: 4 of 14
63. (fly r1 p2 p3)
   deleted: (at r1 p2)
   added: (at r1 p3)
   goals met: 4 of 14
64. (fly r1 p3 p4)
   deleted: (at r1 p3)
   added: (at r1 p4)
   goals met: 4 of 14
65. (fly r1 p4 p5)
   deleted: (at r1 p4)
   added: (at r1 p5)
   goals met: 4 of 14
66. (fly r1 p5 p6)
   deleted: (at r1 p5)
   added: (at r1 p6)
   goals met: 4 of 14
67. (fly r1 p6 p7)
   deleted: (at r1 p6)
   added: (at r1 p7)
   goals met: 4 of 14
68. (fly r1 p7 p8)
   deleted: (at r1 p7)
   added: (at r1 p8)
   goals met: 4 of 14
69. (fly r1 p8 p9)
   deleted: (at r1 p8)
   added: (at r1 p9)
   goals met: 4 of 14
70. (fly r1 p9 p10)
   deleted: (at r1 p9)
   added: (at r1 p10)
   goals met: 4 of 14
71. (unload crate_10 r1 p10)
   deleted: (in crate_10 r1)
   added: (at crate_10 p10)
   changed: (capacity r1) from 1 to 0
   goals met: 5 of 14
72. (fly r2 p13 depot)
   deleted: (at r2 p13)
   added: (at r2 depot)
   goals met: 5 of 14
73. (load crate_9 r2 depot)
   deleted: (at crate_9 depot)
   added: (in crate_9 r2)
   changed: (capacity r2) from 0 to 1
   goals met: 5 of 14
74. (fly r2 depot p1)
   deleted: (at r2 depot)
   added: (at r2 p1)
   goals met: 5 of 14
75. (fly r2 p1 p2)
   deleted: (at r2 p1)
   added: (at r2 p2)
   goals met: 5 of 14
76. (fly r2 p2 p3)
   deleted: (at r2 p2)
   added: (at r2 p3)
   goals met: 5 of 14
77. (fly r2 p3 p4)
   deleted: (at r2 p3)
   added: (at r2 p4)
   goals met: 5 of 14
78. (fly r2 p4 p5)
   deleted: (at r2 p4)
   added: (at r2 p5)
   goals met: 5 of 14
79. (fly r2 p5 p6)
   deleted: (at r2 p5)
   added: (at r2 p6)
   goals met: 5 of 14
80. (fly r2 p6 p7)
   deleted: (at r2 p6)
   added: (at r2 p7)
   goals met: 5 of 14
81. (fly r2 p7 p8)
   deleted: (at r2 p7)
   added: (at r2 p8)
   goals met: 5 of 14
82. (fly r2 p8 p9)
   deleted: (at r2 p8)
   added: (at r2 p9)
   goals met: 5 of 14
83. (unload crate_9 r2 p9)
   deleted: (in crate_9 r2)
   added: (at crate_9 p9)
   changed: (capacity r2) from 1 to 0
   goals met: 6 of 14
84. (fly r3 p12 depot)
   deleted: (at r3 p12)
   added: (at r3 depot)
   goals met: 6 of 14
85. (load crate_8 r3 depot)
   deleted: (at crate_8 depot)
   added: (in crate_8 r3)
   changed: (capacity r3) from 0 to 1
   goals met: 6 of 14
86. (fly r3 depot p1)
   deleted: (at r3 depot)
   added: (at r3 p1)
   goals met: 6 of 14
87. (fly r3 p1 p2)
   deleted: (at r3 p1)
   added: (at r3 p2)
   goals met: 6 of 14
88. (fly r3 p2 p3)
   deleted: (at r3 p2)
   added: (at r3 p3)
   goals met: 6 of 14
89. (fly r3 p3 p4)
   deleted: (at r3 p3)
   added: (at r3 p4)
   goals met: 6 of 14
90. (fly r3 p4 p5)
   deleted: (at r3 p4)
   added: (at r3 p5)
   goals met: 6 of 14
91. (fly r3 p5 p6)
   deleted: (at r3 p5)
   added: (at r3 p6)
   goals met: 6 of 14
92. (fly r3 p6 p7)
   deleted: (at r3 p6)
   added: (at r3 p7)
   goals met: 6 of 14
93. (fly r3 p7 p8)
   deleted: (at r3 p7)
   added: (at r3 p8)
   goals met: 6 of 14
94. (unload crate_8 r3 p8)
   deleted: (in crate_8 r3)
   added: (at crate_8 p8)
   changed: (capacity r3) from 1 to 0
   goals met: 7 of 14
95. (fly r4 p11 depot)
   deleted: (at r4 p11)
   added: (at r4 depot)
   goals met: 7 of 14
96. (load crate_7 r4 depot)
   deleted: (at crate_7 depot)
   added: (in crate_7 r4)
   changed: (capacity r4) from 0 to 1
   goals met: 7 of 14
97. (fly r4 depot p1)
   deleted: (at r4 depot)
   added: (at r4 p1)
   goals met: 7 of 14
98. (fly r4 p1 p2)
   deleted: (at r4 p1)
   added: (at r4 p2)
   goals met: 7 of 14
99. (fly r4 p2 p3)
   deleted: (at r4 p2)
   added: (at r4 p3)
   goals met: 7 of 14
100. (fly r4 p3 p4)
   deleted: (at r4 p3)
   added: (at r4 p4)
   goals met: 7 of 14
101. (fly r4 p4 p5)
   deleted: (at r4 p4)
   added: (at r4 p5)
   goals met: 7 of 14
102. (fly r4 p5 p6)
   deleted: (at r4 p5)
   added: (at r4 p6)
   goals met: 7 of 14
103. (fly r4 p6 p7)
   deleted: (at r4 p6)
   added: (at r4 p7)
   goals met: 7 of 14
104. (unload crate_7 r4 p7)
   deleted: (in crate_7 r4)
   added: (at crate_7 p7)
   changed: (capacity r4) from 1 to 0
   goals met: 8 of 14
105. (fly r1 p10 depot)
   deleted: (at r1 p10)
   added: (at r1 depot)
   goals met: 8 of 14
106. (load crate_6 r1 depot)
   deleted: (at crate_6 depot)
   added: (in crate_6 r1)
   changed: (capacity r1) from 0 to 1
   goals met: 8 of 14
107. (fly r1 depot p1)
   deleted: (at r1 depot)
   added: (at r1 p1)
   goals met: 8 of 14
108. (fly r1 p1 p2)
   deleted: (at r1 p1)
   added: (at r1 p2)
   goals met: 8 of 14
109. (fly r1 p2 p3)
   deleted: (at r1 p2)
   added: (at r1 p3)
   goals met: 8 of 14
110. (fly r1 p3 p4)
   deleted: (at r1 p3)
   added: (at r1 p4)
   goals met: 8 of 14
111. (fly r1 p4 p5)
   deleted: (at r1 p4)
   added: (at r1 p5)
   goals met: 8 of 14
112. (fly r1 p5 p6)
   deleted: (at r1 p5)
   added: (at r1 p6)
   goals met: 8 of 14
113. (unload crate_6 r1 p6)
   deleted: (in crate_6 r1)
   added: (at crate_6 p6)
   changed: (capacity r1) from 1 to 0
   goals met: 9 of 14
114. (fly r2 p9 depot)
   deleted: (at r2 p9)
   added: (at r2 depot)
   goals met: 9 of 14
115. (load crate_5 r2 depot)
   deleted: (at crate_5 depot)
   added: (in crate_5 r2)
   changed: (capacity r2) from 0 to 1
   goals met: 9 of 14
116. (fly r2 depot p1)
   deleted: (at r2 depot)
   added: (at r2 p1)
   goals met: 9 of 14
117. (fly r2 p1 p2)
   deleted: (at r2 p1)
   added: (at r2 p2)
   goals met: 9 of 14
118. (fly r2 p2 p3)
   deleted: (at r2 p2)
   added: (at r2 p3)
   goals met: 9 of 14
119. (fly r2 p3 p4)
   deleted: (at r2 p3)
   added: (at r2 p4)
   goals met: 9 of 14
120. (fly r2 p4 p5)
   deleted: (at r2 p4)
   added: (at r2 p5)
   goals met: 9 of 14
121. (unload crate_5 r2 p5)
   deleted: (in crate_5 r2)
   added: (at crate_5 p5)
   changed: (capacity r2) from 1 to 0
   goals met: 10 of 14
122. (fly r3 p8 depot)
   deleted: (at r3 p8)
   added: (at r3 depot)
   goals met: 10 of 14
123. (load crate_4 r3 depot)
   deleted: (at crate_4 depot)
   added: (in crate_4 r3)
   changed: (capacity r3) from 0 to 1
   goals met: 10 of 14
124. (fly r3 depot p1)
   deleted: (at r3 depot)
   added: (at r3 p1)
   goals met: 10 of 14
125. (fly r3 p1 p2)
   deleted: (at r3 p1)
   added: (at r3 p2)
   goals met: 10 of 14
126. (fly r3 p2 p3)
   deleted: (at r3 p2)
   added: (at r3 p3)
   goals met: 10 of 14
127. (fly r3 p3 p4)
   deleted: (at r3 p3)
   added: (at r3 p4)
   goals met: 10 of 14
128. (unload crate_4 r3 p4)
   deleted: (in crate_4 r3)
   added: (at crate_4 p4)
   changed: (capacity r3) from 1 to 0
   goals met: 11 of 14
129. (fly r4 p7 depot)
   deleted: (at r4 p7)
   added: (at r4 depot)
   goals met: 11 of 14
130. (load crate_3 r4 depot)
   deleted: (at crate_3 depot)
   added: (in crate_3 r4)
   changed: (capacity r4) from 0 to 1
   goals met: 11 of 14
131. (fly r4 depot p1)
   deleted: (at r4 depot)
   added: (at r4 p1)
   goals met: 11 of 14
132. (fly r4 p1 p2)
   deleted: (at r4 p1)
   added: (at r4 p2)
   goals met: 11 of 14
133. (fly r4 p2 p3)
   deleted: (at r4 p2)
   added: (at r4 p3)
   goals met: 11 of 14
134. (unload crate_3 r4 p3)
   deleted: (in crate_3 r4)
   added: (at crate_3 p3)
   changed: (capacity r4) from 1 to 0
   goals met: 12 of 14
135. (fly r1 p6 depot)
   deleted: (at r1 p6)
   added: (at r1 depot)
   goals met: 12 of 14
136. (load crate_2 r1 depot)
   deleted: (at crate_2 depot)
   added: (in crate_2 r1)
   changed: (capacity r1) from 0 to 1
   goals met: 12 of 14
137. (fly r1 depot p1)
   deleted: (at r1 depot)
   added: (at r1 p1)
   goals met: 12 of 14
138. (fly r1 p1 p2)
   deleted: (at r1 p1)
   added: (at r1 p2)
   goals met: 12 of 14
139. (unload crate_2 r1 p2)
   deleted: (in crate_2 r1)
   added: (at crate_2 p2)
   changed: (capacity r1) from 1 to 0
   goals met: 13 of 14
140. (fly r2 p5 depot)
   deleted: (at r2 p5)
   added: (at r2 depot)
   goals met: 13 of 14
141. (load crate_1 r2 depot)
   deleted: (at crate_1 depot)
   added: (in crate_1 r2)
   changed: (capacity r2) from 0 to 1
   goals met: 13 of 14
142. (fly r2 depot p1)
   deleted: (at r2 depot)
   added: (at r2 p1)
   goals met: 13 of 14
143. (unload crate_1 r2 p1)
   deleted: (in crate_1 r2)
   added: (at crate_1 p1)
   changed: (capacity r2) from 1 to 0
   goals met: 14 of 14
